/*****************************************************************************/
//按键key_int0与单片机的P3.2连接，当按下按键时，会触发外部中断。
//本程序利用按键控制LED闪烁
/*****************************************************************************/
#include<reg51.h>
sbit LED = P0^0;
bit i;
void int0_isr(void) interrupt 0           //INT0中断服务函数，INT0的中断号为0
{	
	
	i = ~i;                               //INT0中断1次，i值改变1次
	LED = i;                              //INT0中断1次，LED工作状态变化1次
	while(!INT0);                          //如果按键一直按，等待
}
void main(void)
{	
	LED = 0;                              //芯片初始化时，LED灭
	EA = 0;                               
	EX0 = 1;                              //开启INT0中断
	PX0 = 1;                              //INT0中断优先，可以省去
	EA = 1;                               //开启总中断开关
	while(1);                             //等待按键按下，中断发生
}
/*****************************************************************************/
