/*****************************************************************************/
#include<reg51.h>
sbit LED0 = P0^0;
sbit key5 = P3^2;
bit i;
void int0_isr(void) interrupt 0           //INT0中断服务函数，INT0的中断号为0
{	
	i = !i;
	LED0 = i;                             //INT0中断1次，LED工作状态变化1次
	while(key5 == 0)EX0 = 0;				  //按键按下时刻，禁止中断
	EX0 = 1;										  //按键抬起，允许中断
}
void main(void)
{		
	P0 = 0;											//P0口全为低电平
	EX0 = 1;                               //开启INT0中断
	PX0 = 1;                               //INT0中断优先，可以省去
	EA = 1;                                //开启总中断开关
	IT0 = 0;                               //设置外部中断0为低电平有效触发
	while(1);                              //等待按键按下，中断发生
}
/*****************************************************************************/
